<?php
//Дан произвольный двухмерный массив:

// [
// 	[11, 12, 13, 14, 15],
// 	[21, 22, 23, 24, 25],
// 	[31, 32, 33, 34, 35],
// 	[41, 42, 43, 44, 45],
// 	[51, 52, 53, 54, 55],
// ]
// Получите массив элементов его главной диагонали:

// [
// 	11, 22, 33, 44, 55
// ]

$arr = [
	[11, 12, 13, 14, 15],
	[21, 22, 23, 24, 25],
	[31, 32, 33, 34, 35],
	[41, 42, 43, 44, 45],
	[51, 52, 53, 54, 55],
];

$diagonal = [];
$rows = count($arr);
$cols = count($arr[0]);

if ($rows === $cols) {
    for ($i = 0; $i < $rows; $i++) {
        $diagonal[] = $arr[$i][$i];
    }
}

echo "<pre>";
print_r($diagonal);
echo "</pre>";