<?php

//№1 Дан массив со словами. Удалите из него слова, состоящие более чем из трех символов.

$arr_1 = ["weq","weq","weq","weq","weq","890123890231890","akolp;sdjkajkp;" ];

echo "<pre>";
print_r(array_filter($arr_1, fn($item)=>mb_strlen($item)<=3));

//№2 Дано некоторое число: 1357 Проверьте, что все цифры этого числа являются нечетными.

$n_2 = 13572;
$count =0;
for($i=0; $i<strlen($n_2);$i++){
	if (((string)$n_2)[$i]%2!==0){
		$count=0;
	}else{
		$count+=1;
	}
}
if($count===0){
	echo "все цифры этого числа являются нечетными";
}else{
	echo "[object Object]";
}

//№3 Дано некоторое слово: 'abcba' Проверьте, что это слово читается одинаково с любой стороны.

$n_3 = 'abcba';
echo "<pre>";
print($n_3===strrev($n_3));

//№4 Дан массив:
// [
// 	[
// 		[11, 12, 13],
// 		[14, 15, 16],
// 		[17, 17, 19],
// 	],
// 	[
// 		[21, 22, 23],
// 		[24, 25, 26],
// 		[27, 27, 29],
// 	],
// 	[
// 		[31, 32, 33],
// 		[34, 35, 36],
// 		[37, 37, 39],
// 	],
// ]
//Найдите сумму элементов этого массива.

$arr_4 = 
[
	[
		[11, 12, 13],
		[14, 15, 16],
		[17, 17, 19],
	],
	[
		[21, 22, 23],
		[24, 25, 26],
		[27, 27, 29],
	],
	[
		[31, 32, 33],
		[34, 35, 36],
		[37, 37, 39],
	],
];

$summa=0;

foreach ($arr_4 as $key => $value) {
	foreach ($arr_4[$key] as $value2) {
		$summa +=array_sum($value2);
	}
}

echo $summa;