<?php
//№3

// Дан произвольный двухмерный массив:

// [
// 	[11, 12, 13, 14, 15],
// 	[21, 22, 23, 24, 25],
// 	[31, 32, 33, 34, 35],
// 	[41, 42, 43, 44, 45],
// 	[51, 52, 53, 54, 55],
// ]
// Обнулите элементы, находящиеся ниже главной диагонали:

// [
// 	[11, 12, 13, 14, 15],
// 	[ 0, 22, 23, 24, 25],
// 	[ 0,  0, 33, 34, 35],
// 	[ 0,  0,  0, 44, 45],
// 	[ 0,  0,  0,  0, 55],
// ]
$arr = [
    [11, 12, 13, 14, 15],
    [21, 22, 23, 24, 25],
    [31, 32, 33, 34, 35],
    [41, 42, 43, 44, 45],
    [51, 52, 53, 54, 55],
];

$rows = count($arr);
$cols = count($arr[0]);
for ($row = 1; $row < $rows; $row++) {
    for ($col = 0; $col < $cols; $col++) {
        if ($col < $row) {
            $arr[$row][$col] = 0;
        }
    }
}
echo "<pre>";
foreach ($arr as $row) {
    echo implode(" ", $row)."\n";
}
echo "</pre>";
